In [1]:
import pandas as pd

vendedores = pd.DataFrame([{'ID': 1,'Nombre': 'Albert'},
                           {'ID': 2,'Nombre': 'Yefri'},
                           {'ID': 3,'Nombre': 'Ezequiel'},
                           {'ID': 4,'Nombre': 'Tal√≥n'}])

ventas = pd.DataFrame([{'IDventas': 1,'Producto': 'Lavadora', 'Idvendedor': 2}, 
                       {'IDventas': 2,'Producto': 'Nevera', 'Idvendedor': 3}, 
                       {'IDventas': 3,'Producto': 'Nevera', 'Idvendedor': 1}, 
                       {'IDventas': 4,'Producto': 'Licuadora', 'Idvendedor': 2},
                       {'IDventas': 4,'Producto': 'Nevera', 'Idvendedor': 3},
                       {'IDventas': 4,'Producto': 'Lavadora', 'Idvendedor': 1}])

tabla = pd.merge(vendedores,ventas,left_on='ID',right_on='Idvendedor')

tabla.drop(['ID','Idvendedor'],axis=1)

     Nombre  IDventas   Producto
0    Albert         3     Nevera
1    Albert         4   Lavadora
2     Yefri         1   Lavadora
3     Yefri         4  Licuadora
4  Ezequiel         2     Nevera
5  Ezequiel         4     Nevera